build/articles/command_line_parsing_with_a_metaprogram.html

<div class="outline-2">
<h2>Abstract</h2>
<div class="outline-text-2">
<p>
With work, using a metaprogram to compile source code implementing
command line parsing can provide a uniform interface that is language
agnostic. The problem of command line parsing is one that must be
solved for every new command line utility written, regardless of the
implementation language. Although there are solutions for this
common problem for each programming language in the form of
libraries, it requires learning the specifics of each
library. Additionally, this approach removes the need to add a command
line parsing library as a dependency to a project. This can be
attractive to programmers who share an aesthetic for writing programs
with a minimum number of external dependencies.
</p>
</div>
</div>

<div class="outline-2">
<h2>Table</h2>
<div class="outline-text-2">
<p>
Here is a table.
</p>
</div>

<div class="outline-3">
<h3>Incoming table</h3>
<div class="outline-text-3">
<table>


<colgroup>
<col  class="org-right">

<col  class="org-right">

<col  class="org-right">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">one</th>
<th scope="col" class="org-right">two</th>
<th scope="col" class="org-right">three</th>
<th scope="col" class="org-right">four</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">7</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">10</td>
<td class="org-right">11</td>
<td class="org-right">12</td>
</tr>
</tbody>
</table>

<p>
Look, does this work?
</p>
</div>
</div>

<div class="outline-3">
<h3>A literate program</h3>
<div class="outline-text-3">
<div class="org-src-container"><pre class="src src-c" id="an_example_file."><span class="personal-site-org-src-name">&lt&ltAn example file.&gt&gt=

</span>#include &lt;stdio.h&gt;

int main(void)
{
	<a href=#print_a_message_to_the_user>&lt;&lt;Print a message to the user&gt;&gt;</a>
	return 0;        
}
</pre>
<div class="scroll"><div class="anchor"></div></div></div>

<p>
And then, we can print the message:
</p>
<div class="org-src-container"><pre class="src src-c" id="print_a_message_to_the_user"><span class="personal-site-org-src-name">&lt&ltPrint a message to the user&gt&gt=

</span>puts("Hello, world.");
</pre>
<div class="scroll"><div class="anchor"></div></div></div>
</div>
</div>

<div class="outline-3">
<h3>Another test</h3>
<div class="outline-text-3">
<p>
Here is a nice quotation:
</p>

<blockquote>
<p>
What are blah blah doing blah blah waaaaaa
</p>
</blockquote>
</div>
</div>
</div>
